[
    {
        "id": 1,
        "title": "IAFCertSearch",
        "company": "IThinkWeb Corporation",
        "technology": [
            "PHP",
            "Laravel",
            "MySQL",
            "MongoDB",
            "DynamoDB",
            "OpenSearch"
        ],
        "position": "Junior Backend Developer",
        "description": "IAFCertSearch is a global database used to validate and verify the status of accredited certifications issued by certification bodies worldwide. It helps businesses, governments, and consumers confirm the legitimacy of management system certifications, ensuring transparency and trust in global supply chains.",
        "link": "https://iafcertsearch.org/",
        "github_link": null,
        "src": "ithinkweb_logo.png",
        "alt":  "IThinkWeb Logo",
        "roleDescription": "I am one of the junior backend developers in this company and collaborated with the different teams in the company. I am tasked to apply new features and bug fixes for every release."
    },
    {
        "id": 2,
        "title": "Cadet Information System",
        "company": "Philippine Military Academy",
        "technology": [
            "PHP",
            "Laravel",
            "MySQL",
            "Javascript",
            "HTML",
            "Blade",
            "AJAX",
            "Tailwind"
        ],
        "position": "Computer Programmer (Apprentice)",
        "description": "The Cadet Information System project is a centralized platform where historical and current cadet data are digitized. This system empowers academy staff to efficiently create, retrieve, update, and archive cadet information.",
        "link": null,
        "github_link": null,
        "src": "pma_logo.png",
        "alt": "Philippine Military Academy Logo",
        "roleDescription": "I am one of the key developers in this project that developed both the backend and frontend of the project. We developed this project in an Agile type of SDLC where we constantly get feedbacks from our supervisor every week."
    },
    {
        "id": 3,
        "title": "IntelliDocs",
        "company":  "Saint Louis University (Baguio City)",
        "technology": [
            "Node.JS",
            "MongoDB",
            "Pug",
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "position": "Full Stack Developer",
        "description": "IntelliDocs is a project where all university documents are centralized and digitized. The system enabled teachers and staff to efficiently create, retrieve, update, and delete documents. The system allows users with access to: create a template, request for approval, approve, print documents, and many more.",
        "link": null,
        "github_link": "https://github.com/Shunsena-Jian/Intellidocs",
        "src": "slu_logo.png",
        "alt": "Saint Louis University Logo",
        "roleDescription": "I am one of the key developers in this project that developed both the backend and frontend of the project. We developed this project in an Agile type of SDLC where we constantly get feedbacks from our Thesis Advisor every week."
    }
]
